[
  {
    "department": "In Store Roles",
    "role_name": "Crew Member",
    "description": "Join our frontline team...",
    "description2": "Join our frontline team as a Crew Member, Trainee Crew Member, Junior Crew Member, or Senior Crew Member to provide exceptional service to customers in our virtual stores.",
    "link2": "discord.com",
    "link": "/apply/1",
    "exclusive": false
  },
  {
    "department": "Executive Team",
    "role_name": "Chief Development Officer",
    "description": "For those with exceptional leadership and development skills.",
    "link": "/apply/2",
    "description2": "Join Our Executive Team as an Assistant Development Officer!\n\nAre you passionate about game development, teamwork, and making a real impact in the Roblox community? We’re looking for a dedicated and creative individual to join our Executive Team as an Assistant Development Officer.\n\nAs an ADO, you will work closely with our Chief Development Officer and leadership team to help plan, manage, and oversee the creation of in-game assets, features, and systems. Your support will help ensure our projects stay on track and meet our group’s high standards.\n\nResponsibilities:\n- Assist in managing ongoing development projects and schedules\n- Collaborate with developers, builders, scripters, and designers\n- Help test and review game features for quality and functionality\n- Provide regular updates to the Development Officer and executive staff\n- Help organize team meetings and coordinate task distribution\n- Maintain clear documentation of progress and team input\n\nRequirements:\n- Strong interest in Roblox development and game production\n- Great communication and organizational skills\n- Ability to work as part of a team and take initiative\n- Knowledge of Roblox Studio and development workflow \n- Willingness to learn and grow within the role\n\nPerks:\n- Be part of a passionate and active team\n- Gain leadership and project management experience\n- Contribute to exciting and creative Roblox games\n- Opportunities for advancement within the group\n\nIf you’re ready to help shape the future of our group and support awesome game projects, apply now and show us what you can bring to the team!"    "link2": "discord.com",
    "exclusive": true
  }
]
